app/Http/Controllers/LocaleController.php

update `users` set `locale` = 'en', `users`.`updated_at` = '2025-07-04 13:08:07' where `id` = 1
---
    public function switch(Request $request): JsonResponse
    {
        $validator = Validator::make($request->all(), [
            'locale' => 'required|string|in:' . implode(',', array_keys(config('locale.supported', []))),
        ]);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Invalid locale provided.',
                'errors' => $validator->errors(),
            ], 422);
        }

        $locale = $request->input('locale');
        $supportedLocales = config('locale.supported', []);

        if (!isset($supportedLocales[$locale])) {
            return response()->json([
                'success' => false,
                'message' => 'Unsupported locale.',
            ], 400);
        }

        // Store locale in session
        Session::put('locale', $locale);

        // Update user's locale preference if authenticated
        if (Auth::check()) {
            Auth::user()->update(['locale' => $locale]);